<font size="4" color="BLUE"> 題網 範例11.13 p592</font></br>
<img src="https://raw.githubusercontent.com/cathouse2477/statimage/main/stat_11.13_p592.jpg" align="left" width="80%">

<font size="5" color="orange">二因子變異數分析</font>

In [189]:
import numpy as np 
import numpy as np
import pandas as pd
import statsmodels.api as sm
from statsmodels.formula.api import ols

df=pd.DataFrame({
    'operator': np.tile(np.repeat( ["operator-1","operator-2","operator-3","operator-4","operator-5"],1),3),
     'machine': np.repeat( ["machine-1","machiner-2","machine-3"],5),
     'output' : [53,47,46,50,49,51,51,49,54,50,61,55,52,58,54]})
df
#df[:10]
## 'sun': np.tile(np.repeat(['low', 'med', 'high'], 5), 2),

      operator     machine  output
0   operator-1   machine-1      53
1   operator-2   machine-1      47
2   operator-3   machine-1      46
3   operator-4   machine-1      50
4   operator-5   machine-1      49
5   operator-1  machiner-2      51
6   operator-2  machiner-2      51
7   operator-3  machiner-2      49
8   operator-4  machiner-2      54
9   operator-5  machiner-2      50
10  operator-1   machine-3      61
11  operator-2   machine-3      55
12  operator-3   machine-3      52
13  operator-4   machine-3      58
14  operator-5   machine-3      54

In [190]:
import statsmodels.api as sm
from statsmodels.formula.api import ols

#perform two-way ANOVA
model = ols('output ~ C(operator) + C(machine) ', data=df).fit()
sm.stats.anova_lm(model, typ=2)

             sum_sq   df          F    PR(>F)
C(operator)    72.0  4.0   6.545455  0.012193
C(machine)    130.0  2.0  23.636364  0.000439
Residual       22.0  8.0        NaN       NaN

結論:  </br>
1. 機器的性能會顯著影響產量，換言之，機器的性能存在顯著差異。 </br>
2.作業員的能力會顯著影響產量，換言之，作業員的能力存在顯著差異。

Source: https://www.youtube.com/watch?v=T2-h1RyCYEQ

In [191]:
df

      operator     machine  output
0   operator-1   machine-1      53
1   operator-2   machine-1      47
2   operator-3   machine-1      46
3   operator-4   machine-1      50
4   operator-5   machine-1      49
5   operator-1  machiner-2      51
6   operator-2  machiner-2      51
7   operator-3  machiner-2      49
8   operator-4  machiner-2      54
9   operator-5  machiner-2      50
10  operator-1   machine-3      61
11  operator-2   machine-3      55
12  operator-3   machine-3      52
13  operator-4   machine-3      58
14  operator-5   machine-3      54

In [201]:
df['output'].sum() ## Yij和

780

In [193]:
df.groupby(['operator']).sum()

            output
operator
operator-1     165
operator-2     153
operator-3     147
operator-4     162
operator-5     153

In [203]:
165**2+153**2+147**2+162**2+ 153**2  ## Yidot平

121896

In [192]:
df.groupby(['machine']).sum()

            output
machine
machine-1      245
machine-3      280
machiner-2     255

In [202]:
 245**2+280**2+255**2   ## Ydotj平

203450

In [194]:
df['output_square']=df['output']**2
df

      operator     machine  output  output_square
0   operator-1   machine-1      53           2809
1   operator-2   machine-1      47           2209
2   operator-3   machine-1      46           2116
3   operator-4   machine-1      50           2500
4   operator-5   machine-1      49           2401
5   operator-1  machiner-2      51           2601
6   operator-2  machiner-2      51           2601
7   operator-3  machiner-2      49           2401
8   operator-4  machiner-2      54           2916
9   operator-5  machiner-2      50           2500
10  operator-1   machine-3      61           3721
11  operator-2   machine-3      55           3025
12  operator-3   machine-3      52           2704
13  operator-4   machine-3      58           3364
14  operator-5   machine-3      54           2916

In [199]:
2809+2209+2116+2500+2401+2601+2601+2401+2916+2500+3721+3025+2704+3364+2916 ## Yij平

40784

In [195]:
df.groupby(['operator']).sum()

            output  output_square
operator
operator-1     165           9131
operator-2     153           7835
operator-3     147           7221
operator-4     162           8780
operator-5     153           7817

40784

In [197]:
df.groupby(['machine']).sum()

            output  output_square
machine
machine-1      245          12035
machine-3      280          15730
machiner-2     255          13019

In [198]:
12035+15730+13019 ##Y.j平

40784